app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    @line_item.product = product

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "2"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 17 Mar 2015 05:46:39 UTC +00:00], ["updated_at", Tue, 17 Mar 2015 05:46:39 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 30], ["created_at", Wed, 18 Mar 2015 02:23:46 UTC +00:00], ["product_id", 1], ["quantity", nil], ["updated_at", Wed, 18 Mar 2015 02:23:46 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2015-03-18 02:05:13.379759' WHERE "line_items"."id" = 5